HW3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<!-- 2016-10-25 Tue 13:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ДЗ 3</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Михаил Волхов M3438" />
</head>
<body>
<div id="content">
<h1 class="title">ДЗ 3</h1>
<div id="table-of-contents">
<h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Формулировка задания</a></li>
<li><a href="#orgheadline2">2. Функциональные зависимости</a></li>
<li><a href="#orgheadline3">3. Ключи</a></li>
<li><a href="#orgheadline4">4. Неприводимые множества ФЗ</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Формулировка задания</h2>
<div class="outline-text-2" id="text-1">
<p>
Имея отношения с атрибутами \(StudentId, StudentName, GroupId,
  GroupName, CourseId, CourseName, LecturerId, LecturerName, Mark\):
</p>
<ol class="org-ol">
<li>Найти функциональные зависимости.</li>
<li>Найти ключи.</li>
<li>Найти НМФЗ.</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Функциональные зависимости</h2>
<div class="outline-text-2" id="text-2">
<p>
Будем считать, что группа &#x2013; это параметр, зависимый от года (то
есть, строка "M3438", а не "третья группа потока year2013"). Таблица
функциональных зависимостей без учета тривиальных:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Зависимость</th>
<th scope="col" class="org-left">Пояснение</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(StudentId → StudentName\)</td>
<td class="org-left">Нумерация студентов</td>
</tr>

<tr>
<td class="org-left">\(StudentId → GroupId\)</td>
<td class="org-left">Каждый студент находится в одной группе</td>
</tr>

<tr>
<td class="org-left">\(GroupId → GroupName\)</td>
<td class="org-left">Нумерация групп</td>
</tr>

<tr>
<td class="org-left">\(CourseId → CourseName\)</td>
<td class="org-left">Нумерация курсов</td>
</tr>

<tr>
<td class="org-left">\(LecturerId → LecturerName\)</td>
<td class="org-left">Нумерация преподавателей</td>
</tr>

<tr>
<td class="org-left">\(CourseId, GroupId → LecturerId\)</td>
<td class="org-left">Курс должен вестись преподавателем (разные группы могут иметь разных)</td>
</tr>

<tr>
<td class="org-left">\(StudentId, CourseId, GroupId → Mark\)</td>
<td class="org-left">Каждый год (определяется группой) каждый студент получает оценку по каждому курсу</td>
</tr>
</tbody>
</table>
<p>
Сделаем два замечания:
</p>
<ol class="org-ol">
<li>Четыре ФЗ выражают похожую зависимость \(*Id → *Name\).</li>
<li>Модель "курс и группа определяют преподавателя", выражаемая
шестой ФЗ, не соответствует в точности жизненным реалиям (один
предмет у одной группы могут вести несколько преподавателей).</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Ключи</h2>
<div class="outline-text-2" id="text-3">
<p>
Будем искать ключ по определению как минимальный по включению
надключ, исключая элементы по очереди из очевидного надключа &#x2013;
множества всех атрибутов без дубликатов с "Name" (возьмем только
Id).
</p>
<ul class="org-ul">
<li>\(StudentId, GroupId, CourseId, LecturerId, Mark\)</li>
<li>Уберем Mark, потому что он однозначно определяется первыми тремя
атрибутами: \(StudentId, GroupId, CourseId, LecturerId\).</li>
<li>Аналогично с помощью предпоследней зависимости элиминируем
\(LecturerId\): \(StudentId, GroupId, CourseId\)</li>
<li>Используя вторую ФЗ также избавимся от \(GroupId\): \(StudentId,
    CourseId\).</li>
<li>\(⟨StudentId, CourseId⟩\) есть минимальный по включению надключ, то
есть является ключом. Заметим, что любой другой порядок устранения
элементов из множества атрибутов привел бы к этому же ключу,
следовательно он единственный.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Неприводимые множества ФЗ</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Для каждого правила расщепим правую часть чтобы она стала
единичной. Эта операция не имеет смысла, так как нетривиальные ФЗ
нашей модели и так содержат только по одному атрибуту справа.</li>
<li>Будем удалять атрибуты \(A\) из \(A ∪ X → B\), такие что \((A ∪
     X)^{+}_{S} = A^{+}_{S}\). Очевидно, что на этом шаге ФЗ, в которых
левая часть содержит только один элемент (\(*Id → *Name\)) не
могут быть выкинуты из сета.
<ol class="org-ol">
<li><p>
\(StudentId, GroupId, CourseId → Mark\)
</p>

<p>
Поскольку \(StudentId^+_S = \{StudentId, StudentName, GroupId,
        GroupName\}\), то очевидно \((StudentId, GroupId, CourseId)^+_S =
        (StudentId, CourseId)^+_S\), поэтому, приняв \(GroupId\) за \(A\),
выкинем его из этого правила.
</p>

<p>
\(StudentId, CourseId → Mark\)
</p></li>
<li><p>
\(CourseId, GroupId → LecturerId\)
</p>
<ul class="org-ul">
<li>\(CourseId^+_S = \{CourseId, CourseName\}\).</li>
<li>\(GroupId^+_S = \{GroupId, GroupName\}\).</li>
</ul>
<p>
Наблюдаем, что ни \(CourseId^+\), ни \(GroupId^+\) не содержат
\(LecturerId\), следовательно это правило неприменимо.
</p></li>
</ol></li>
<li>Удалим все правила \(A → B\), что \(B ⊂ A^+_{S ∖ \{A →
     B\}}\). Проверив руками дополнения оставшихся множеств, убедимся,
что таких правил нет (долго писать руками; можно дерево
нарисовать на бумажке для наглядности).</li>
</ol>

<p>
Итоговое неприводимое множество ФЗ:
</p>
<ul class="org-ul">
<li>\(StudentId → StudentName\)</li>
<li>\(StudentId → GroupId\)</li>
<li>\(GroupId → GroupName\)</li>
<li>\(CourseId → CourseName\)</li>
<li>\(LecturerId → LecturerName\)</li>
<li>\(GroupId, CourseId → LecturerId\)</li>
<li>\(StudentId, CourseId → Mark\)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#1040;&#1074;&#1090;&#1086;&#1088;: Михаил Волхов M3438</p>
<p class="date">Created: 2016-10-25 Tue 13:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
